
&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СписокТоваров.ТекущиеДанные;
	ПересчитатьСуммуВСтрокеТЧ(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СписокТоваров.ТекущиеДанные;
	ПересчитатьСуммуВСтрокеТЧ(ТекущаяСтрока);
КонецПроцедуры


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций
&НаКлиенте
Процедура ПересчитатьСуммуВСтрокеТЧ(ТекущаяСтрока)
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;  
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФорма

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
